Екі өлшемді массивтің әр жолындағы элементтердің орташа мәнін есептеу үшін бағдарлама жазыңыз. Бағдарлама массивтің өлшемін (жолдар мен бағандар саны) және элементтердің мәндерін енгізіп, содан кейін әр жолдың орташа мәнін шығаруы керек.
Мысал:
Кіріс деректері:
Жолдар санын енгізіңіз: 3
Бағандар санын енгізіңіз: 4
Массив элементтерін енгізіңіз:
1 2 3 4
5 6 7 8
9 10 11 12

Шығу деректері:
0 Жолдағы элементтердің орташа мәні: 2.5
1 Жолдағы элементтердің орташа мәні: 6.5
2 Жолдағы элементтердің орташа мәні: 10.5

Тапсырманы https://t.me/nazarbekmb сілтемесі бойынша жіберу қажет және https://docs.google.com/spreadsheets/d/1UsTsrlCyB-gzDwc6XIPYpZ7MktmOkTVqHkTT9eikytc/edit?usp=sharing сілтемесі бойынша тіркеліп қорғау қажет.
P.S. қосымша сұрақтарыңыз болса чаты арқылы қоя аласыз https://t.me/+rq0xb3r_USxlN2Ni
